js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file cli.c
 * @brief Single-char command shell exercising the QSPI driver from a
 *        UART4 console.  Polled RX (no IRQ).  Every command is a single
 *        printable letter followed by space-separated decimal/hex args.
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include "cli.h"
#include "board.h"
#include "printf.h"
#include "qspi.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_gpio.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define LINEMAX  80
#define MAX_ARGS 8
#define READ_CAP 1024U
#define WRITE_CAP 256U
#define RXBUF    256

static char linebuf[LINEMAX + 1];
static int  linelen;
static bool busy_flag;
static bool four_byte_mode;
static uint32_t pend_confirm_C_until;
static uint8_t  io_buf[READ_CAP];

/* Software RX ring drained both from cli_poll and from inside the TX
 * char-write hook -- TX'ing a long printf burst takes longer than the
 * 1-byte hardware RX FIFO can hold, so we must drain on every char. */
static volatile uint8_t  rx_ring[RXBUF];
static volatile uint16_t rx_head;
static volatile uint16_t rx_tail;

bool cli_busy(void) { return busy_flag; }

static void rx_drain_hw(void)
{
   while (UART4->ISR & USART_ISR_RXNE_RXFNE) {
      uint8_t c = (uint8_t)(UART4->RDR & 0xFFU);
      uint16_t nh = (uint16_t)((rx_head + 1U) % RXBUF);
      if (nh != rx_tail) {
         rx_ring[rx_head] = c;
         rx_head          = nh;
      }
      /* else drop on overflow */
   }
}

static int uart_rx_byte(int *out)
{
   rx_drain_hw();
   if (rx_head == rx_tail)
      return 0;
   *out    = rx_ring[rx_tail];
   rx_tail = (uint16_t)((rx_tail + 1U) % RXBUF);
   return 1;
}

static void uart_tx_byte(char c)
{
   while (!(UART4->ISR & USART_ISR_TXE))
      rx_drain_hw();
   UART4->TDR = (uint8_t)c;
}

static void prompt(void)
{
   my_printf("> ");
}

static int parse_args(char *p, char **argv, int max)
{
   int n = 0;
   while (*p && n < max) {
      while (*p == ' ' || *p == '\t')
         p++;
      if (!*p)
         break;
      argv[n++] = p;
      while (*p && *p != ' ' && *p != '\t')
         p++;
      if (*p) {
         *p++ = '\0';
      }
   }
   return n;
}

static uint32_t arg_u32(const char *s, uint32_t dflt)
{
   if (!s || !*s)
      return dflt;
   char *e = NULL;
   uint32_t v = (uint32_t)strtoul(s, &e, 0);
   if (e == s)
      return dflt;
   return v;
}

static void hexdump(uint32_t base, const uint8_t *data, uint32_t n)
{
   for (uint32_t i = 0; i < n; i += 16U) {
      my_printf("%08lx:", (unsigned long)(base + i));
      uint32_t row = (n - i) < 16U ? (n - i) : 16U;
      for (uint32_t j = 0; j < row; j++)
         my_printf(" %02x", data[i + j]);
      my_printf("\r\n");
   }
}

/* -------- command handlers ---------------------------------------- */

static void cmd_help(void)
{
   my_printf(
      "QSPI shell:\r\n"
      " i              JEDEC RDID 0x9F\r\n"
      " f <a> <n>      SFDP read 0x5A\r\n"
      " s [opc=0x05]   opcode-then-1-byte (RDSR)\r\n"
      " ?              status: busy / presc / fsize / csht\r\n"
      " r <a> <n> [op=0x03]   1-lane read\r\n"
      " F <a> <n>      fast read 0x0B\r\n"
      " q <a> <n>      quad-output read 0x6B\r\n"
      " X <a> <n>      quad-I/O read 0xEB\r\n"
      " 2 <a> <n>      dual-output read 0x3B\r\n"
      " 3 <a> <n>      dual-I/O read 0xBB (alt=0xA0, 4 dummy)\r\n"
      " M <a> <n>      memory-mapped read\r\n"
      " b <n> [q=0/1]  bench streaming read\r\n"
      " e [opc=0x06]   opcode-only (WREN)\r\n"
      " W <v> [op=0x01]  write status reg (op + 1B data)\r\n"
      " w <a> <n> [op=0x02]   1-lane page program\r\n"
      " Q <a> <n>      quad-input PP 0x32\r\n"
      " S <a>          sector erase 4 KB (0x20)\r\n"
      " B <a>          block  erase 64 KB (0xD8)\r\n"
      " C              chip erase 0xC7 (confirm)\r\n"
      " P [op] [m] [v] auto-poll status (default WIP=0)\r\n"
      " 4 [0/1]        exit/enter 4-byte addr (0xE9/0xB7)\r\n"
      " R              soft reset 0x66 0x99\r\n"
      " D              deep power-down 0xB9\r\n"
      " d              release DPD 0xAB\r\n"
      " p <n>          set prescaler\r\n"
      " g <mask6>      raw GPIO drive (bits: CLK NCS IO0 IO1 IO2 IO3)\r\n"
      " t [ms=1]       toggle all 6 pins forever (reset to stop)\r\n"
      " x              abort + drain FIFO\r\n"
      " h              this help\r\n");
}

static void cmd_jedec(void)
{
   const qspi_cmd_t c = {
      .instruction = 0x9FU, .inst_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len = 3U,
   };
   uint8_t id[3] = {0};
   if (qspi_xfer(&c, QSPI_FMODE_READ, id, 100U) != HAL_OK) {
      my_printf("ERR jedec\r\n");
      return;
   }
   my_printf("JEDEC ID: %02x %02x %02x\r\n", id[0], id[1], id[2]);
}

static void cmd_sfdp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction  = 0x5AU,
      .address      = addr,
      .addr_bytes   = 3U,
      .dummy_cycles = 8U,
      .inst_lines   = QSPI_LINES_1,
      .addr_lines   = QSPI_LINES_1,
      .data_lines   = QSPI_LINES_1,
      .data_len     = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 1000U) != HAL_OK) {
      my_printf("ERR sfdp\r\n");
      return;
   }
   my_printf("SFDP @ 0x%08lx (%lu bytes)\r\n",
             (unsigned long)addr, (unsigned long)len);
   hexdump(addr, io_buf, len);
}

static void cmd_status(int argc, char **argv)
{
   uint32_t opc = arg_u32(argc > 0 ? argv[0] : NULL, 0x05U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc, .inst_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len = 1U,
   };
   uint8_t v = 0xFFU;
   if (qspi_xfer(&c, QSPI_FMODE_READ, &v, 100U) != HAL_OK) {
      my_printf("ERR status\r\n");
      return;
   }
   my_printf("op=%02x -> %02x\r\n", (unsigned)opc, v);
}

static void cmd_query(void)
{
   my_printf("busy=%d presc=%lu fsize=%lu csht=%lu\r\n",
             qspi_busy(),
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)qspi_get_fsize(),
             (unsigned long)qspi_get_csht());
}

