js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   uint32_t opc  = arg_u32(argc > 2 ? argv[2] : NULL, 0x03U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR read\r\n");
      return;
   }
   my_printf("op=%02x read %lu @ 0x%08lx\r\n",
             (unsigned)opc, (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_fast_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction  = 0x0BU,
      .address      = addr, .addr_bytes = 3U,
      .dummy_cycles = 8U,
      .inst_lines   = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines   = QSPI_LINES_1, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR fast\r\n");
      return;
   }
   my_printf("op=0b read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_quad_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction  = 0x6BU,
      .address      = addr, .addr_bytes = 3U,
      .dummy_cycles = 8U,
      .inst_lines   = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines   = QSPI_LINES_4, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR quadr\r\n");
      return;
   }
   my_printf("op=6b read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_quad_io_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction   = 0xEBU,
      .address       = addr, .addr_bytes = 3U,
      .alt_bytes     = 0xA0U, .alt_bytes_len = 1U,
      .dummy_cycles  = 4U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_4,
      .alt_lines     = QSPI_LINES_4,
      .data_lines    = QSPI_LINES_4,
      .data_len      = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR quadio\r\n");
      return;
   }
   my_printf("op=eb read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_dual_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction  = 0x3BU,
      .address      = addr, .addr_bytes = 3U,
      .dummy_cycles = 8U,
      .inst_lines   = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines   = QSPI_LINES_2, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR dualr\r\n");
      return;
   }
   my_printf("op=3b read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_dual_io_read(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction   = 0xBBU,
      .address       = addr, .addr_bytes = 3U,
      .alt_bytes     = 0xA0U, .alt_bytes_len = 1U,
      .dummy_cycles  = 4U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_2,
      .alt_lines     = QSPI_LINES_2,
      .data_lines    = QSPI_LINES_2,
      .data_len      = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR dualio\r\n");
      return;
   }
   my_printf("op=bb read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_mm(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction   = 0xEBU,
      .addr_bytes    = 3U,
      .alt_bytes     = 0xA0U, .alt_bytes_len = 1U,
      .dummy_cycles  = 4U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_4,
      .alt_lines     = QSPI_LINES_4,
      .data_lines    = QSPI_LINES_4,
   };
   if (qspi_mm_enable(&c) != HAL_OK) {
      my_printf("ERR mm\r\n");
      return;
   }
   const volatile uint8_t *src =
       (const volatile uint8_t *)(QSPI_MM_BASE + addr);
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = src[i];
   qspi_mm_disable();
   my_printf("MM read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_bench(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 256U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   if (len == 0U) len = 256U;
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = 8U;

   uint32_t crc = 0, firsterr = 0, dt = 0;
   uint8_t  fe_got = 0;
   HAL_StatusTypeDef s = qspi_bench_read(opcode, dl, dummy, len,
                                         &crc, &firsterr, &fe_got, &dt);
   if (s != HAL_OK) {
      my_printf("ERR bench (%d)\r\n", (int)s);
      busy_flag = false;
      return;
   }
   if (dt == 0U) dt = 1U;
   uint32_t kbps = (len + dt * 512U) / (dt * 1024U);
   /* Avoid 32-bit overflow in (len * 1000) for len >= 4 MB. */
   if (len <= 4000000U)
      kbps = (len * 1000U) / (dt * 1024U);
   else
      kbps = ((len / 1024U) * 1000U) / dt;
   if (firsterr == 0xFFFFFFFFU) {
      my_printf("bench %lu B %s @ presc=%lu in %lu ms, %lu KB/s, "
                "crc32=%08lx, firsterr=-1\r\n",
                (unsigned long)len,
                quad ? "quad" : "1lane",
                (unsigned long)qspi_get_prescaler(),
                (unsigned long)dt, (unsigned long)kbps,
                (unsigned long)crc);
   } else {
      const uint8_t exp = (uint8_t)(firsterr & 0xFFU);
      my_printf("bench %lu B %s @ presc=%lu in %lu ms, %lu KB/s, "
                "crc32=%08lx, firsterr=%lu (exp=%02x got=%02x)\r\n",
                (unsigned long)len,
                quad ? "quad" : "1lane",
                (unsigned long)qspi_get_prescaler(),
                (unsigned long)dt, (unsigned long)kbps,
                (unsigned long)crc,
                (unsigned long)firsterr,
                (unsigned)exp, (unsigned)fe_got);
   }
   busy_flag = false;
}

static void cmd_op_only(int argc, char **argv)
{
   uint32_t opc = arg_u32(argc > 0 ? argv[0] : NULL, 0x06U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR op\r\n");
      return;
   }
   my_printf("op=%02x sent\r\n", (unsigned)opc);
}

