js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_wrsr(int argc, char **argv)
{
   uint32_t val = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t opc = arg_u32(argc > 1 ? argv[1] : NULL, 0x01U);
   uint8_t  v   = (uint8_t)val;
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .inst_lines  = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1,
      .data_len    = 1U,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, &v, 100U) != HAL_OK) {
      my_printf("ERR wrsr\r\n");
      return;
   }
   my_printf("op=%02x wrote SR=%02x\r\n", (unsigned)opc, (unsigned)v);
}

static void cmd_pp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   uint32_t opc  = arg_u32(argc > 2 ? argv[2] : NULL, 0x02U);
   if (len > WRITE_CAP) len = WRITE_CAP;
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = (uint8_t)(i & 0xFFU);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR pp\r\n");
      return;
   }
   my_printf("op=%02x wrote %lu bytes @ 0x%08lx\r\n",
             (unsigned)opc, (unsigned long)len, (unsigned long)addr);
}

static void cmd_qpp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > WRITE_CAP) len = WRITE_CAP;
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = (uint8_t)(0xC0U + (i & 0x0FU));
   const qspi_cmd_t c = {
      .instruction = 0x32U,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_4, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR qpp\r\n");
      return;
   }
   my_printf("op=32 wrote %lu bytes @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
}

static void cmd_erase(uint8_t opc, uint32_t kib_or_zero,
                      int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   const qspi_cmd_t c = {
      .instruction = opc,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 1000U) != HAL_OK) {
      my_printf("ERR erase\r\n");
      return;
   }
   if (kib_or_zero)
      my_printf("op=%02x erased %lu KB @ 0x%08lx\r\n",
                (unsigned)opc, (unsigned long)kib_or_zero,
                (unsigned long)addr);
   else
      my_printf("op=%02x erased chip\r\n", (unsigned)opc);
}

static void cmd_chip_erase_pending(void)
{
   pend_confirm_C_until = HAL_GetTick() + 2000U;
   my_printf("Type C again to confirm.\r\n");
}

static void cmd_chip_erase_do(void)
{
   const qspi_cmd_t c = {
      .instruction = 0xC7U, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 1000U) != HAL_OK) {
      my_printf("ERR chip\r\n");
      return;
   }
   my_printf("op=c7 erased chip\r\n");
}

static void cmd_autopoll(int argc, char **argv)
{
   uint32_t opc   = arg_u32(argc > 0 ? argv[0] : NULL, 0x05U);
   uint32_t mask  = arg_u32(argc > 1 ? argv[1] : NULL, 0x01U);
   uint32_t match = arg_u32(argc > 2 ? argv[2] : NULL, 0x00U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .inst_lines  = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1,
      .data_len    = 1U,
   };
   busy_flag = true;
   uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = qspi_autopoll(&c, mask, match, 16U, 5000U);
   uint32_t dt = HAL_GetTick() - t0;
   busy_flag = false;
   if (s == HAL_OK)
      my_printf("autopoll op=%02x mask=%02lx match=%02lx done in %lu ms\r\n",
                (unsigned)opc, (unsigned long)mask, (unsigned long)match,
                (unsigned long)dt);
   else
      my_printf("autopoll TIMEOUT after %lu ms\r\n", (unsigned long)dt);
}

static void cmd_4byte(int argc, char **argv)
{
   bool enter;
   if (argc > 0)
      enter = arg_u32(argv[0], 0U) != 0U;
   else
      enter = !four_byte_mode;
   uint8_t opc = enter ? 0xB7U : 0xE9U;
   const qspi_cmd_t c = {
      .instruction = opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR 4byte\r\n");
      return;
   }
   four_byte_mode = enter;
   my_printf("4byte=%d (op=%02x)\r\n", enter ? 1 : 0, (unsigned)opc);
}

static void cmd_reset(void)
{
   const qspi_cmd_t a = { .instruction = 0x66U, .inst_lines = QSPI_LINES_1 };
   const qspi_cmd_t b = { .instruction = 0x99U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&a, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK ||
       qspi_xfer(&b, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR reset\r\n");
      return;
   }
   my_printf("reset (66 99) sent\r\n");
}

static void cmd_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xB9U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR dpd\r\n");
      return;
   }
   my_printf("op=b9 deep power-down\r\n");
}

static void cmd_release_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xABU, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR rdpd\r\n");
      return;
   }
   my_printf("op=ab release DPD\r\n");
}

static void cmd_prescaler(int argc, char **argv)
{
   uint32_t p = arg_u32(argc > 0 ? argv[0] : NULL, qspi_get_prescaler());
   if (p > 255U) {
      my_printf("ERR presc range\r\n");
      return;
   }
   /* Enable 1/2-cycle sample shift at high SCLK so MISO sampling is
    * stable above ~50 MHz.  ker_ck on this project is ~266 MHz, so
    * presc <= 3 (>=66 MHz) gets the shift. */
   const uint32_t sshift = (p <= 3U) ? 1U : 0U;
   if (qspi_init(p, qspi_get_fsize(), qspi_get_csht(), sshift, false)
       != HAL_OK) {
      my_printf("ERR reinit\r\n");
      return;
   }
   busy_flag = false;
   my_printf("presc=%lu sshift=%lu\r\n",
             (unsigned long)p, (unsigned long)sshift);
}

/* -------- raw GPIO bring-up helpers ------------------------------- */

